# IFC_ImportNoUI

## Description
Imports IFC file, silent mode

```pascal
PROCEDURE IFC_ImportNoUI(strFilePath : STRING);
```

```python

def vs.IFC_ImportNoUI(strFilePath):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|strFilePath|STRING||

## Version
Availability: from Vectorworks 2014
## Category
* IFC